{"src/platform/common/utils/localize":["Python","Ja","Nein","Ja, bitte","Abgebrochen","Abbrechen","OK","Herunterladen","Verstanden!","Installieren","Jupyter-Erweiterung wird geladen...","Ausgabe anzeigen","Nein, mache ich später","Nicht jetzt","Nicht mehr anzeigen","Erneut laden","Mehr Info","Weitere Informationen","und","Melden Sie dieses Problem","Klicken Sie <a href='{0}'>hier</a>, um weitere Informationen zu erhalten.","Erinnern Sie mich später","Ja, nehmen Sie jetzt an der Umfrage teil","Nein, danke","{0} wird heruntergeladen...","{0}{1} von {2} KB ({3}%)","Der Benutzer gehört der Experimentgruppe „{0}“ an.","Jupyter","Fehler beim Übermitteln Ihrer GitHub Issue. Möchten Sie trotzdem ein Problem melden?","Ja, Inhalt in die Zwischenablage kopieren und Problem öffnen","Bitte geben Sie einen beschreibenden Titel an, der Ihr Problem zusammenfasst.","E.g.: Unable to start a local kernel session","Bitte füllen Sie diesen Abschnitt aus, und löschen Sie diesen Kommentar, bevor Sie ein Problem einreichen!","Bitte eben Sie Details zu dem aufgetretenen Problem an, bevor Sie auf „GitHub-Issue übermitteln“ klicken.","Sie haben die Debug-Protokollierung für die Jupyter-Erweiterung aktiviert, die weiterhin Protokolle auf die Festplatte schreibt. Möchten Sie die Debug-Protokollierung deaktivieren?","Ja, Debuggenprotokollierung deaktivieren","Nein","Nein, und nicht mehr fragen","Möchten Sie, dass die Tastenkombination UMSCHALT-EINGABE Code an die neue Interactive-Fenster-Erfahrung sendet?","Können Sie sich bitte eine Minute Zeit nehmen, um uns über Ihre Notebooks-Erfahrung in VS Code zu informieren?","Können Sie sich bitte 2 Minuten Zeit nehmen, um uns mitzuteilen, wie die Python Data Science-Features für Sie funktionieren?","Ja, nehmen Sie jetzt an der Umfrage teil","Nein, danke","Die Erweiterung für Notebook Renderers wird installiert... ","abgeschlossen.","Der Download der Erweiterung für Notebook Renderers wird gestartet.","Die Erweiterung für Notebook Renderers wird heruntergeladen... ","Der Download der Erweiterung für Notebook Renderers ist abgeschlossen.","Können Sie sich bitte 2 Minuten Zeit nehmen, um uns mitzuteilen, wie die Python-Erweiterung für Sie funktioniert?","Ja, nehmen Sie jetzt an der Umfrage teil","Nein, danke","Vielleicht später","{0} wird installiert","The version of Python associated with the selected kernel is no longer supported. Please consider selecting a different kernel.","Python-Erweiterung ist zum Ausführen von Python-Notebooks erforderlich.","Python-Erweiterung installieren und Kernel lokalisieren.","Layout anpassen","Die Python-Erweiterung ist erforderlich, um diese Aufgabe auszuführen. Klicken Sie auf „Ja“, um die Installationsseite der Python-Erweiterung zu öffnen.","Die Python-Erweiterung ist jetzt installiert. Einige Funktionen sind möglicherweise erst verfügbar, wenn eine Notebook- oder interaktive Fenstersitzung neu gestartet wird.","Der Server-URI kann nicht verwendet werden. Haben Sie eine Erweiterung deinstalliert, die eine Jupyter-Serververbindung bereitgestellt hatte?","{0} (Von {1}-Erweiterung)","unbekannt","Interaktiv","Interaktiv – {0}","Möchten Sie ein neues Interactive-Fenster für diese Datei öffnen? [Weitere Informationen](command:workbench.action.openSettings?%5B%22jupyter.interactiveWindowMode%22%5D).","Ja","Immer","Nein","Daten-Viewer","<html><body><h1>{0} ist kein gültiger Dateiname</h1></body></html>","Es wird überprüft, ob „importieren“ unterstützt wird","Fehlende Abhängigkeiten werden installiert","Validating kernel dependencies","Export wird durchgeführt","Umwandeln nach PDF","Notebook wird nach Python exportiert","Der Code kann nicht ausgeführt werden, die Sitzung wurde verworfen.","Fehler beim Herstellen einer Verbindung mit dem kennwortgeschützten Server. Überprüfen Sie, ob das Kennwort richtig ist.","Raw kernel process was not able to start.","Raw kernel process exited before connecting.","MIME Typ {0} wird derzeit nicht unterstützt.","In Jupyter Notebook exportieren","Jupyter-Notebooks","Notebook geschrieben zu {0}","Notizbuch konnte nicht exportiert werden. {0}","In Editor öffnen","Zelle ausführen","Importieren von Jupyter Notebook","Möchten Sie die Jupyter Notebook in Python-Code importieren?","Importieren","Später","Nicht mehr fragen","Die Data Science-Bibliothek {0} ist nicht installiert. Installieren?","Die Data Science-Bibliothek {0} ist nicht ordnungsgemäß installiert oder veraltet. Erneut installieren?","Das {0}-Paket konnte nicht installiert werden. Wenn Pip nicht verfügbar ist, verwenden Sie bitte den Paketmanager Ihrer Wahl, um diese Bibliothek manuell in Ihrer Python-Umgebung zu installieren.","Zum Ausführen von Zellen ist das {0}-Paket erforderlich.","Zum Ausführen von Zellen ist das {0}-Paket erforderlich.","Das Ausführen von Zellen mit „{0}“ erfordert das {1}-Paket.","Das Ausführen von Zellen mit „{0}“ erfordert das {1}-Paket.","Das Ausführen von Zellen mit „{0}“ erfordert, dass das {1}-Paket installiert ist, oder es erfordert ein Update.","Das Ausführen von Zellen mit „{0}“ erfordert das {1}-Paket.","Führen Sie den folgenden Befehl aus, um „{0}“ in der Python-Umgebung zu installieren. \r\nBefehl: „{1}“","Wählen Sie einen Interpreter aus, um Jupyter zu starten.","Installieren","aktuell: {0}","Jupyter kann nicht gestartet werden. Fehler beim Versuch, Jupyter zu finden: {0}","Das Aktivieren von {0} zum Ausführen von Jupyter ist mit {1} fehlgeschlagen.","Jupyter nbconvert ist nicht installiert.","Der Jupyter Notebook-Server konnte nicht rechtzeitig gestartet werden","Die URL des gestarteten Jupyter Notebook-Servers konnte nicht gefunden werden.","Das vom Server {0} verwendete Sicherheitszertifikat wurde nicht von einer vertrauenswürdigen Zertifizierungsstelle ausgestellt.\r\nDies kann auf einen Versuch hinweisen, Ihre Informationen zu stehlen.\r\nMöchten Sie die Einstellung „Nicht autorisierte Remoteverbindung zulassen“ für diesen Arbeitsbereich aktivieren, damit Sie eine Verbindung herstellen können?","Das vom Server {0} verwendete Sicherheitszertifikat ist abgelaufen.\r\nDies kann auf einen Versuch hindeuten, Ihre Informationen zu stehlen.\r\nMöchten Sie die Einstellung „Unautorisierte Remoteverbindung zulassen“ für diesen Arbeitsbereich aktivieren, damit Sie eine Verbindung herstellen können?","Das vom Server verwendete Sicherheitszertifikat wurde nicht von einer vertrauenswürdigen Zertifizierungsstelle ausgestellt.\r\nDies kann auf einen Versuch hinweisen, Ihre Informationen zu stehlen.","Das vom Server verwendete Sicherheitszertifikat ist abgelaufen.\r\nDies kann auf einen Versuch hinweisen, Ihre Informationen zu stehlen.","Ja, trotzdem verbinden","Nein, Verbindung schließen","Siehe <https://aka.ms/pyaiinstall>, um Hilfe bei der Installation von Jupyter zu erhalten.","Siehe <https://aka.ms/pyaiinstall>, um Hilfe zum Installieren von Jupyter und zugehörigen Abhängigkeiten zu erhalten.","{0} wird importiert","Jupyter-Server wird gestartet","Connecting to kernel: {0}","Verbunden.","Verbindung mit dem Jupyter-Server wird hergestellt","{0} wird exportiert","Alle Zellen ausführen","Oben ausführen","Unten ausführen","Do you want to restart the Jupyter kernel? All variables will be lost.","Neu starten","Nicht mehr fragen","Abbrechen","Kernel {0} wird neu gestartet","Der Kernel-Neustart ist fehlgeschlagen. Der Jupyter-Server reagiert nicht mehr. Bitte laden Sie VS Code neu.","Die Kernel-Unterbrechung ist fehlgeschlagen. Der Jupyter-Server reagiert nicht mehr. Bitte laden Sie den VS Code neu.","Fehler beim Starten des Kernels „{0}“. \r\nWeitere Details finden Sie im Jupyter-[Protokoll](command:jupyter.viewOutput).","Fehler beim Starten von Jupyter in der Umgebung „{0}“. \r\nWeitere Details finden Sie im Jupyter-[Protokoll](command:jupyter.viewOutput).","Fehler beim Starten von Jupyter in der Umgebung „{0}“. \r\n{1} \r\nWeitere Details finden Sie in Jupyter-[Protokoll](command:jupyter.viewOutput).","Fehler beim Starten von Jupyter in der Umgebung „{0}“, möglicherweise aufgrund einer veralteten Version von „traitlets“. \r\n{1} \r\nErwägen Sie, das Modul „traitlets“ auf „5.1.1“ oder höher zu aktualisieren. \r\nWeitere Details finden Sie im Jupyter-[Protokoll](command:jupyter.viewOutput).","Der Kernel konnte nicht gestartet werden.","Neustart des Kernels fehlgeschlagen.","Fehler beim Unterbrechen des Kernels.","Der Kernel „{0}“ kann aufgrund eines Verbindungstimeouts nicht gestartet werden. \r\nWeitere Details finden Sie im Jupyter-[Protokoll](command:jupyter.viewOutput).","Weitere Informationen finden Sie im Jupyter-[Protokoll](command:jupyter.viewOutput).","The kernel died. Error: {0}... View Jupyter [log](command:jupyter.viewOutput) for further details.","Der Kernel „{0}“ wurde unerwartet beendet. Klicken Sie [hier](https://aka.ms/vscodeJupyterKernelCrash), um weitere Informationen zu erhalten. Weitere Details finden Sie im Jupyter-[Protokoll](command:jupyter.viewOutput).","The kernel '{0}' died and is being automatically restarted by Jupyter. Click [here](https://aka.ms/vscodeJupyterKernelCrash) for more info. View Jupyter [log](command:jupyter.viewOutput) for further details.","Der Kernel ist beim Ausführen von Code in der aktuellen Zelle oder einer vorherigen Zelle abgestürzt. Bitte überprüfen Sie den Code in der/den Zelle(n), um eine mögliche Fehlerursache zu identifizieren. Klicken Sie <a href='https://aka.ms/vscodeJupyterKernelCrash'>hier</a>, um weitere Informationen zu erhalten. Weitere Details finden Sie in Jupyter [log](command:jupyter.viewOutput).","Cannot run cells, as the kernel '{0}' is dead.","Jupyter-Protokolle anzeigen.","Zelle wird ausgeführt","Alle Zelleneingaben reduzieren","Erweitern Sie alle Zelleneingaben","Reduzieren","Erweitern","Als Jupyter-Notebook exportieren","Jupyter-Kernel neu starten","Kernel neu starten","Rückgängig","Wiederholen","Datei speichern","Alle Zellen entfernen","Bitte laden Sie das Fenster neu, damit die neuen Einstellungen wirksam werden.","{0} wurde neu gestartet","_{0} wird neu gestartet..._","_Restarting kernel..._","{0} wurde gestartet","_Connecting to kernel..._","_Verbinden mit {0}..._","Verbunden mit {0}","Geben Sie den URI des laufenden Jupyter-Servers ein","Geben Sie den URI des laufenden Jupyter-Servers ein","Option wählen","Aktuell: {0}","Keine","Stellen Sie keine Verbindung zu einem Remote-Jupyter-Server her","Letzte Verbindung: {0}","Vorhanden","Geben Sie den URI eines vorhandenen Servers an","Es wurde ein ungültiger URI angegeben.","Letzte Verbindung {0}. {1} bestehende Verbindungen.","Derzeit kann keine Verbindung hergestellt werden. Unbekannter Status.","Geben Sie Ihren Benutzernamen und Ihr Kennwort ein, um eine Verbindung mit dem Jupyter-Hub herzustellen.","Geben Sie Ihren Benutzernamen ein","Geben Sie Ihr Kennwort ein","Python is not installed. \nPlease [download](https://www.python.org/downloads) and install Python in order to execute cells in this notebook.","Python is not installed. \nPlease download and install Python in order to execute cells in this notebook from here https://www.python.org/downloads.","Der Jupyter-Kernel „{0}“ konnte nicht gefunden werden und muss installiert werden, um Zellen in diesem Notebook auszuführen.","Jupyter-Notebook konnte nicht gestartet werden. \r\n{0}","Der von der Erweiterung „{0}“ beigetragene Remote-Jupyter-Server ist nicht mehr verfügbar.","Fehler beim Herstellen einer Verbindung mit dem Remote-Jupyter-Server „{0}“. Vergewissern Sie sich, dass der Server ausgeführt wird und erreichbar ist. ({1}).","Fehler beim Herstellen einer Verbindung mit dem Remote-Jupyter-Server „{0}“. Vergewissern Sie sich, dass der Server ausgeführt wird und erreichbar ist.","Verbindungsfehler. Vergewissern Sie sich, dass der Server ausgeführt wird und erreichbar ist. ({0}).","Verbindungsfehler. Vergewissern Sie sich, dass der Server ausgeführt wird und über einen Browser erreichbar ist. ({0}). Weitere Informationen finden Sie unter https://aka.ms/vscjremoteweb.","Verbindung vergessen","Fehler beim Herstellen einer Verbindung mit dem Jupyter-Remoteserver.\r\nÜberprüfen Sie, ob der Jupyter-Server-URI über den Browser erreicht werden kann.\r\n{0}. Klicken Sie [hier](https://aka.ms/vscjremoteweb), um weitere Informationen zu erhalten.","Verbindungen verwalten","Ändern Sie die Jupyter-Serververbindung.","Fehler beim Herstellen einer Verbindung mit dem Remote-Jupyter Notebook.\r\nDer angegebene Server verwendet selbstsignierte Zertifikate. Aktivieren Sie die Einstellung „Nicht autorisierte Remoteverbindung zulassen“, um trotzdem eine Verbindung herzustellen\r\n{0}\r\n{1}","Direct kernel connection","Direct kernel connection broken","Der Jupyter-Server ist abgestürzt. Es kann keine Verbindung hergestellt werden. \r\nFehlercode von Jupyter: {0}","Jupyter Notebook-Version: {0}","Cannot create a Jupyter kernel spec and none are available for use","Das „Kernelspec“-Modul ist im ausgewählten Interpreter ({0}) nicht installiert.\r\n Bitte Installieren oder aktualisieren Sie „Jupyter“ erneut.","Jupyter-Kernel unterbrechen","Alle Ausgaben löschen","Jupyter-Kernel wird unterbrochen","Abbrechen","Python-Skript","HTML","PDF","Interrupting the kernel timed out. Do you want to restart the kernel instead? All variables will be lost.","Keyboard interrupt crashed the kernel. Kernel restarted.","Jupyter-Server-URI: ","Code ausführen fehlgeschlagen: {0}","Geben Sie hier Code ein und drücken Sie zum Ausführen die Tastenkombination UMSCHALT-EINGABE.","Es kann keine Verbindung zum Hosten der Jupyter-Sitzung hergestellt werden. Der URI wurde nicht gefunden.","Das Erstellen von Jupyter-Notebooks wird über eine Live Share-Verbindung nicht unterstützt.","Das Importieren von Notebooks wird derzeit über eine Live Share-Verbindung nicht unterstützt","{0} Jupyter-Server","Synchronisierungsfehler während dem Live Share-Start.","Fehler beim Starten des Dienstes „{0}“ während der Live Share-Verbindung.","Zellen können nicht ausgeführt werden, doppelte Dokumente für {0} gefunden.","Variableninformationen konnten nicht vom Jupyter-Server abgerufen werden.","„{0}“ ist keine aktive Variable.","Fehler beim Erstellen eines „interaktiven“ Fensters. Versuchen Sie, die Python-Erweiterung neu zu installieren.","Fehler während der Variablenextraktion: \r\n{0}","wird geladen...","Daten werden abgerufen...","Es stimmen keine Zeilen mit dem aktuellen Filter überein","Jupyter-Server","Kein Kernel","Nicht gestartet","Kernel ändern","Wählen Sie einen anderen Kernel aus","Choose the kernels that are available in the kernel picker.","Interpreter wechseln","lokal","Das Python-Paket „pandas“ hat die Version {0}. Die Version 0.20 oder höher ist zum Anzeigen von Daten erforderlich.","Das Python-Paket „pandas“ ist zum Anzeigen von Daten erforderlich.","Werte","Mindestens ein Gast in der Sitzung hat die Jupyter-Erweiterung nicht installiert. Die Live Share-Sitzung kann nicht fortgesetzt werden.","Das Anzeigen von Variablen mit mehr als 1000 Spalten kann sehr lange dauern. Möchten Sie den Vorgang wirklich fortsetzen?","Ja","Nein","Nicht mehr fragen","Ermöglicht das Filtern mehrerer Zeilen. Verwenden Sie die Zeichen =, > oder <, um numerische Werte zu filtern.","--- Vorschau von {0} starten ---","--- Vorschau von {0} beenden ---","Vorschau von {0} wird generiert","Plots","Plotbild speichern","Zurück","Weiter","Schwenken","Vergrößern","Verkleinern","Export in verschiedene Formate","Entfernen","Geben Sie hier neue Zellen ein.","Ausgewähltes Bild","Bild","Fehler beim Exportieren des Bildes: {0}","Variable kann nicht angezeigt werden, da die Datenrate überschritten wurde. Bitte starten Sie Ihren Server mit einem höheren Datenratenlimit neu. Beispiel: --NotebookApp.iopub_data_rate_limit=10000000000.0","Zelle hinzufügen","Zelle debuggen","Prozedurschritt","Fortfahren","Beenden","Führen Sie die aktuelle Zelle aus, und fügen Sie unten eine leere Zelle hinzu.","Das Pip-Modul {0} ist zum Debuggen von Zellen erforderlich. Sie müssen es installieren, um Zellen zu debuggen.","Die Ausgabe {0} kann nicht geparst werden, bitte melden Sie ein Problem mit https://github.com/microsoft/vscode-jupyter","Der Port {0} kann nicht zum Debuggen geöffnet werden. Bitte geben Sie einen anderen Port in der Einstellung remoteDebuggerPort an.","Der Port {0} kann nicht zum Debuggen verbunden werden. Bitte lassen Sie den Port {0} durch Ihre Firewall.","Ports im Bereich {0}–{1} können zum Debuggen nicht gefunden werden. Bitte geben Sie einen Port in der remoteDebuggerPort-Einstellung an.","Ein Port kann nicht zum Debuggen verbunden werden. Bitte lassen Sie Ports {0}–{1} durch Ihre Firewall.","Das Pip-Modul {0} ist für das Debuggen von Zellen erforderlich. Wollen Sie {0} installieren und mit dem Debuggen der Zelle fortfahren?","Das Pip-Modul {0} ist für den zeilenweise Ausführung erforderlich. Wollen Sie {0} installieren und mit der zeilenweisen Ausführung fortfahren?","Die installierte Version von {0} unterstützt das Debuggen von Zellen nicht. Wollen Sie {0} auf die neueste Version aktualisieren und mit dem Debuggen der Zelle fortfahren?","Die installierte Version von {0} unterstützt keine zeilenweise Ausführung. Wollen Sie {0} auf die neueste Version aktualisieren und weiterhin zeilenweise ausführen?","Ja","Nein","Die Zelle wurde aufgrund eines Fehlers in einer vorherigen Zelle abgebrochen.","Wechseln zu [{0}]","# Um eine neue Zelle hinzuzufügen, geben Sie '{0}' ein\r\n# Um eine neue Markdown-Zelle hinzuzufügen, geben Sie '{0} [markdown]'\r\n ein","Notebook-Editor","Ohne Titel","Möchten Sie die Änderungen speichern, die Sie an \"{0}\" vorgenommen haben?","Ihre Änderungen gehen verloren, wenn Sie sie nicht speichern.","Speichern","Nicht speichern","Abbrechen","Speichern","Jupyter-Notebooks","Exportieren als","Als Python-Datei speichern","Exportieren","Exportieren als...","Möchten Sie die exportierte Datei öffnen?","Ja","Nein","Weitere Details finden Sie im Bereich „Jupyter“-[Ausgabe](command:jupyter.viewOutput).","Wenn Sie XeLaTex (TeX) nicht installiert haben, müssen Sie dies tun, bevor Sie in PDF exportieren können. Weitere Anweisungen finden Sie unter https://nbconvert.readthedocs.io/en/latest/install.html#installing-tex. \r\nUm die Installation von XeLaTex (TeX) zu vermeiden, könnten Sie versuchen, in HTML zu exportieren, und das Feature „Als PDF drucken\" Ihrer Browser zu verwenden.","Fehler beim Exportieren.","Zelle ausführen","Zelle löschen","Zelle nach oben verschieben","Zelle nach unten verschieben","Ausgewählte Zelle nach oben verschieben","Zelle löschen","Zelle unterhalb einfügen","Zelle oberhalb einfügen","Zelle hinzufügen","Zelle einfügen","Konvertieren von ipynb in eine Python-Datei","Es wurde kein Python ausgewählt","python -m jupyter notebook --version wird nicht ausgeführt","Bild speichern","Couldn't find kernel '{0}' that the notebook was created with. Using the current interpreter.","Couldn't find kernel '{0}' that the notebook was created with. Registering a new kernel using the current interpreter.","Couldn't find kernel '{0}' that the notebook was created with.","Jupyter wird von {0} gestartet","Zeitüberschreitung beim Starten von Jupyter. Bitte überprüfen Sie den „Jupyter“-Ausgabebereich für weitere Details.","Kernel wird zu „{0}“ gewechselt.","Warten auf den Leerlauf der Jupyter-Sitzung","Fetching Kernels","Fetching Kernels","Abrufen der Kernel-Spezifikationen","Jupyter Notebook wird gestartet","Registrierung des Kernels","Die Ausgabe wurde aus Leistungsgründen gekürzt.\r\nUm die vollständige Ausgabe anzuzeigen, legen Sie die Einstellung „jupyter.textOutputLimit“ auf 0 fest.","Standard","Die Python-Erweiterung wird die passende Befehlszeile für Jupyter bestimmen.","Benutzerdefiniert","Passen Sie die beim Start an Jupyter übergebene Befehlszeile an","Bitte laden Sie das Fenster neu, wenn Sie die Jupyter-Befehlszeile ändern.","Erneut laden","Option wählen","Wählen Sie die Befehlszeile für Jupyter aus","Geben Sie Ihre benutzerdefinierte Befehlszeile für Jupyter ein","Herstellen einer Verbindung mit dem Jupyter-Server unter {0}","{0}: Neues Notebook wird erstellt ","{0}: Kernel gestartet: {1}","Der Kernel {0} kann nicht verwendet werden. Weitere Informationen finden Sie auf der Registerkarte „Jupyter-Ausgabe“.","{0}. Wir können keinen Jupyter-Server für Sie starten, da Ihr Betriebssystem nicht unterstützt wird. Wählen Sie einen Server aus, der bereits ausgeführt wird, wenn Sie den Vorgang fortsetzen möchten.","Laufenden Server auswählen","Vorhanden","Wählen Sie einen bereits laufenden Jupyter-Server aus","Geben Sie den URI eines vorhandenen Servers an","Entfernen","Jupyter-Server für Verbindungen angeben","Jupyter-Server: Lokal","Jupyter-Server: Remote","Fehler beim Laden von {0}:{1}. Zum Laden von Widgets von Drittanbietern ist eine Internetverbindung erforderlich.","Widgets erfordern, dass wir unterstützende Dateien von der Website eines Drittanbieters herunterladen. Klicken Sie [hier](https://aka.ms/PVSCIPyWidgets), um weitere Informationen zu erhalten.","Widgets erfordern, dass wir unterstützende Dateien von einer Website eines 3 Drittanbieters herunterladen.","Widgets erfordern, dass wir unterstützende Dateien von einer Website eines Drittanbieters herunterladen. Klicken Sie <a href='https://command:jupyter.enableLoadingWidgetScriptsFromThirdPartySource'>hier</a>, um dies zu aktivieren, oder klicken Sie <a href='https://aka.ms/PVSCIPyWidgets'>hier</a> für weitere Information. (Fehler beim Laden {0}:{1}).","Widgets erfordern, dass wir unterstützende Dateien von einer Website eines Drittanbieters herunterladen. (Fehler beim Laden {0}:{1}).","Downloads aktivieren","Unhandled kernel message from a widget: {0} : {1}","Das Widget „{0}“ kann aufgrund des Netzwerkzugriffs nicht von der Website{1} eines 3 Drittanbieters heruntergeladen werden. Das erwartete Verhalten kann beeinträchtigt werden. Klicken Sie [hier](https://aka.ms/PVSCIPyWidgets) für weitere Informationen.","Das Widget „{0}“, Version „{1}“ konnte in konfigurierten Widget-Quellen {2} nicht gefunden werden. Das erwartete Verhalten kann beeinträchtigt sein. Klicken Sie [hier](https://aka.ms/PVSCIPyWidgets), um weitere Informationen zu erhalten.","Eine kompatible Version des Widgets „qgrid“ konnte nicht geladen werden. Erwägen Sie ein Downgrade auf Version 1.1.1.","Started kernel {0}.","Zeilenweise ausführen (F10)","Nächste Zeile ausführen (F10)","Beenden","Unable to start session for kernel {0}. Select another kernel to launch with.","Connecting to kernel.","Eine Verbindung über HTTP ohne Token kann zu einer unsicheren Verbindung führen. Möchten Sie sich mit einem möglicherweise unsicheren Server verbinden?","Verbindung zu unsicherem Server wurde verweigert.","Verbunden","Getrennt","No kernel available for cell execution, please [specify a Jupyter server for connections](command:jupyter.selectjupyteruri)","IPyKernel nicht im Interpreter {0} installiert","Ipykernel-Setup ist für dieses Feature erforderlich","Setup","Zeilenweise Ausführung wird gestartet","Fehler beim Erstellen des Daten-Viewers. Weitere Informationen finden Sie auf der Registerkarte „Jupyter“ im Ausgabefenster.","Wählen Sie eine Option zum Erstellen eines leeren Notebook aus.","Standard","Die Erweiterung {0} wird für Notebooks empfohlen, die auf die Sprache „{1}“ abzielen.","Kernel was not started. A kernel session is needed to start debugging.","Kein aktives Notebook-Dokument zum Debuggen.","Das Debuggen kann nicht gestartet werden.","Notebook-Datei wird importiert","Exportieren nach {0}.","(Remote-) Jupyter-Sitzung","Jupyter-Kernel","(Remote-) Jupyter-Kernel","Conda-Umgebung","Poetry-Umgebung","Pipenv-Umgebung","PyEnv-Umgebung","Globale Umgebung","Virtual-Umgebung","The file '{0}' seems to be overriding built in modules and interfering with the startup of the kernel. Consider renaming the file and starting the kernel again.","„!{0} install“ könnte Pakete in der falschen Umgebung installieren. [Weitere Info]({1})","Verwenden Sie „%{0} install“ anstelle von „!{0} install“","Ersetzen durch „%{0} install“","The kernel failed to start due to the missing module '{0}'. Consider installing this module.","The kernel failed to start as the module '{0}' could not be imported.","The kernel failed to start as '{0}' could not be imported from '{1}'.","The kernel failed to start as a dll could not be loaded.","The kernel failed to start as the dll '{0}' could not be loaded.","The kernel failed to start due to an error with the Win32api module. Consider (re) installing this module.","The kernel failed to start due to an error with the 'pyzmq' module. Consider re-installing this module.","The kernel failed to start due to an outdated version of IPython. Consider updating this module to the latest version.","The kernel failed to start due to an outdated version of IPyKernel. Consider updating this module to the latest version.","Das Widget „%matplotlib“ funktioniert am besten innerhalb von VS Code","Weitere Informationen","Möchten Sie der Erweiterung \"{0}\" Zugriff auf die Jupyter-Kernels gewähren? Wenn Sie auf \"{1}\" klicken, kann diese Erweiterung Code für die Jupyter-Kernels ausführen.","Vielen Dank, dass Sie die Jupyter-API ausprobieren. Bitte reichen Sie ein Problem in unserem Repository ein, um diese API in der Produktion zu verwenden. Dies würde verhindern, dass wir Ihre Erweiterung beim Aktualisieren der API unterbrechen (da sie noch in Bearbeitung ist).","Aktivieren der Python-Umgebung „{0}“","{0} Zelle {1}","Ja","Nein","Nicht mehr fragen","Die „Vorabversion“ der Jupyter-Erweiterung wird empfohlen, wenn sie auf VS Code Insidern ausgeführt wird. Möchten Sie wechseln?","Jupyter Server-Konsole","{0} Kernel-Konsolenausgabe","Der Vorgang wird in der Webversion der Jupyter-Erweiterung nicht unterstützt.","Muss HTTP(S) sein","Fehler beim Installieren der Python-Erweiterung.","In der ausgewählten Umgebung ist kein Conda- oder Pip-Installationsprogramm verfügbar.","In der ausgewählten Umgebung ist kein Pip-Installationsprogramm verfügbar.","Suche nach Hilfe","Konnte nicht installiert werden {0}. Wenn pip nicht verfügbar ist, verwenden Sie bitte den Paketmanager Ihrer Wahl, um diese Bibliothek manuell in Ihrer Python-Umgebung zu installieren.","Die Data Science-Bibliothek {0} ist nicht installiert. Installieren?","{0} wird installiert"]}