{"src/platform/common/utils/localize":["Python","Sí","No","Sí, por favor","Cancelado","Cancelar","Aceptar","Descargar","¡Entendido!","Instalar","Cargando la extensión de Jupyter...","Mostrar salida","No, lo haré más tarde","Ahora no","No volver a mostrar","Recargar","Más información","Más información","y","Informar sobre este problema","Haga clic <a href='{0}'>aquí</a> para obtener más información.","Recordármelo más tarde","Sí, realizar una encuesta ahora","No, gracias","Descargando {0}...","{0}{1} de {2} KB ({3} %)","El usuario pertenece al grupo de experimentos '{0}'","Jupyter","Se ha detectado un error al enviar el Issue de GitHub. ¿Desea informar de un problema?","Sí, copiar contenido en el Portapapeles y abrir incidencia","Proporcione un título descriptivo que resuma el problema.","Por ejemplo: no se puede iniciar una sesión de kernel local","Rellene esta sección y elimine este comentario antes de enviar una incidencia.","Proporcione los detalles del problema que encontró antes de hacer clic en Enviar Issue de GitHub.","Ha habilitado el registro de depuración para la extensión de Jupyter, que seguirá escribiendo registros en el disco. ¿Desea desactivar el registro de depuración?","Sí, desactivar el registro de depuración","No","No, y no volver a preguntar","¿Desea que Mayús-Enter envíe código a la nueva experiencia de ventana interactiva?","¿Puede dedicar un minuto a informarnos sobre su experiencia con los blocs de notas en VS Code?","¿Puede dedicar 2 minutos a indicarnos cómo funcionan las características de ciencia de datos de Python?","Sí, realizar una encuesta ahora","No, gracias","Instalando la extensión Notebook Renderers... ","completado","Iniciando la descarga de la extensión Notebook Renderers.","Descargando la extensión Notebook Renderers... ","Se completó la descarga de la extensión Notebook Renderers.","¿Puede tardar 2 minutos en indicarnos cómo funciona la extensión de Python?","Sí, realizar una encuesta ahora","No, gracias","Quizás más tarde","Instalando {0}","Ya no se admite la versión de Python asociada al kernel seleccionado. Considere la posibilidad de seleccionar un kernel diferente.","Extensión de Python necesaria para ejecutar cuadernos de Python.","Instalación de la extensión Python y localización de kernels.","Personalizar diseño","La extensión de Python es necesaria para realizar esa tarea. Haga clic en Sí para abrir la página de instalación de la extensión de Python.","La extensión de Python ya está instalada. Es posible que algunas características no estén disponibles hasta que se reinicie un cuaderno o una sesión de ventana interactiva.","No se puede usar el URI del servidor. ¿Desinstaló una extensión que proporcionó una conexión de servidor de Jupyter?","{0} (desde la extensión {1} )","desconocido","Interactiva","Interactivo: {0}","¿Desea abrir una nueva ventana interactiva para este archivo? [Más información] (command:workbench.action.openSettings?%5B%22jupyter.interactiveWindowMode%22%5D).","Sí","Siempre","No","Visor de datos","<html><body><h1>{0} no es un nombre de archivo válido</h1></body></html>","Comprobando si se admite \"import\"","Instalando las dependencias que faltan","Validando dependencias de kernel","Realizando exportación","Convirtiendo a PDF","Exportación de Notebook a Python","No se puede ejecutar el código, se ha eliminado la sesión.","No se pudo conectar con el servidor protegido con contraseña. Compruebe que la contraseña es correcta.","No se pudo iniciar el proceso de kernel sin procesar.","El proceso de kernel sin procesar se cerró antes de conectarse.","Actualmente no se admite el tipo MIME {0}","Exportar a Jupyter Notebook","Jupyter Notebooks","Notebook escrito en {0}","No se pudo exportar el cuaderno. {0}","Abrir en el editor","Ejecutar celda","Importar Jupyter Notebook","¿Desea importar el Jupyter Notebook en código de Python?","Importar","Más tarde","No volver a preguntar","La biblioteca de ciencia de datos {0} no está instalada. ¿Desea instalarla?","La biblioteca de ciencia de datos {0} no está instalada correctamente o está obsoleta. ¿Volver a instalar?","No se pudo instalar paquete {0}. Si pip no está disponible, use el administrador de paquetes que prefiera para instalar manualmente esta biblioteca en el entorno de Python.","Las celdas en ejecución requieren {0} paquete.","Las celdas en ejecución requieren {0} paquete.","La ejecución de celdas con '{0}' requieren el paquete {1}.","La ejecución de celdas con '{0}' requieren el paquete {1}.","La ejecución de celdas con '{0}' requiere que se instale el paquete {1} o una actualización.","La ejecución de celdas con '{0}' requieren el paquete {1}.","Ejecute el siguiente comando para instalar '{0}' en el entorno de Python. comando \r\n: '{1}'","Seleccionar un intérprete para iniciar Jupyter","Instalar","actual: {0}","No se puede iniciar Jupyter. Error al intentar buscar Jupyter: {0}","Error al activar {0} para ejecutar Jupyter con {1}","Jupyter nbconvert no está instalado","El servidor de Jupyter Notebook no se pudo iniciar a tiempo","No se pudo encontrar la dirección URL del servidor de Jupyter Notebook iniciado","El certificado de seguridad usado por el servidor {0} no fue emitido por una entidad de certificación de confianza.\r\nEsto puede indicar un intento de robar su información.\r\n¿Desea habilitar la configuración Permitir conexión remota no autorizada para esta área de trabajo para permitir la conexión?","El certificado de seguridad usado por el servidor {0} ha expirado.\r\nEsto puede indicar un intento de robar la información.\r\n¿Desea habilitar la opción Permitir conexión remota no autorizada para esta área de trabajo para que pueda conectarse?","El certificado de seguridad utilizado por el servidor no fue emitido por una entidad de certificación de confianza.\r\nEsto puede indicar un intento de robar la información.","El certificado de seguridad usado por el servidor ha expirado.\r\nEsto puede indicar un intento de robar la información.","Sí, conectar de todos modos","No, cierre la conexión","Consulte <https://aka.ms/pyaiinstall> para obtener ayuda sobre cómo instalar Jupyter.","Consulte <https://aka.ms/pyaiinstall> para obtener ayuda sobre cómo instalar Jupyter y las dependencias relacionadas.","Importando {0}","Iniciando el servidor de Jupyter","Conectando con kernel: {0}","Conectada.","Conectando con el servidor de Jupyter","Exportando {0}","Ejecutar todas las celdas","Ejecutar arriba","Ejecutar a continuación","¿Desea reiniciar el kernel de Jupyter? Se perderán todas las variables.","Reiniciar","No volver a preguntar","Cancelar","Reiniciando Kernel {0}","Error al reiniciar el Kernel. El servidor de Jupyter no responde. Vuelva a cargar VS Code.","Error en la interrupción del Kernel. El servidor de Jupyter no responde. Vuelva a cargar VS Code.","No se pudo iniciar el Kernel '{0}'. \r\nConsulte el [registro] de Jupyter (command:jupyter.viewOutput) para obtener más detalles.","No se pudo iniciar Jupyter en el entorno '{0}'. \r\nVea [log] de Jupyter (command:jupyter.viewOutput) para obtener más detalles.","No se pudo iniciar Jupyter en el entorno '{0}'. \r\n{1} \r\nVea [log] de Jupyter (command:jupyter.viewOutput) para obtener más detalles.","No se pudo iniciar Jupyter en el entorno '{0}' debido posiblemente a una versión obsoleta de 'traitlets'. \r\n{1} \r\nConsidere la posibilidad de actualizar el módulo 'traitlets' a \"5.1.1\" o posterior. \r\nVea jupyter [log](command:jupyter.viewOutput) para obtener más detalles.","No se pudo iniciar el Kernel.","No se pudo reiniciar el Kernel.","No se pudo interrumpir el Kernel.","No se puede iniciar Kernel '{0}' porque se agotó el tiempo de espera de la conexión. \r\nVea el [registro] de Jupyter (command:jupyter.viewOutput) para obtener más detalles.","Vea el [registro] de Jupyter (command:jupyter.viewOutput) para obtener más detalles.","El kernel ha muerto. Error: {0}... Vea Jupyter [log](command:jupyter.viewOutput) para obtener más detalles.","Se ha interrumpido el kernel \"{0}\". Haga clic [aquí](https://aka.ms/vscodeJupyterKernelCrash) para obtener más información. Vea el [registro] de Jupyter (command:jupyter.viewOutput) para obtener más detalles.","El kernel \"{0}\" se ha interrumpido y Jupyter lo está reiniciando automáticamente. Haz clic [aquí](https://aka.ms/vscodeJupyterKernelCrash) para obtener más información. Vea el [registro] de Jupyter (command:jupyter.viewOutput) para obtener más detalles.","El Kernel se bloqueó al ejecutar código en la celda actual o en una celda anterior. Revise el código de las celdas para identificar una posible causa del error. Haga clic <a href='https://aka.ms/vscodeJupyterKernelCrash'>aquí</a> para obtener más información. Vea el [registro] de Jupyter (command:jupyter.viewOutput) para obtener más detalles.","No se pueden ejecutar celdas porque el kernel '{0}' está inactivo.","Mostrar registros de Jupyter.","Ejecutando celda","Contraer todas las entradas de celda","Expandir todas las entradas de celda","Contraer","Expandir","Exportar como cuaderno de Jupyter","Reinicio del kernel de Jupyter","Reiniciar kernel","Deshacer","Rehacer","Guardar archivo","Quitar todas las celdas","Vuelva a cargar la ventana para que la nueva configuración surta efecto.","Se reinició {0}","_Reiniciando{0}..._","_Reiniciando kernel..._","Se inició {0}","_Conectando al kernel..._","Conectando con {0}..._","Conectado a {0}","Escriba el URI del servidor de Jupyter en ejecución","Escriba el URI del servidor de Jupyter en ejecución","Elija una opción","Actual: {0}","Ninguno","No conectarse a ningún servidor remoto de Jupyter","Última conexión: {0}","Existente","Especificar el URI de un servidor existente","Se especificó un URI no válido","Última conexión {0}. {1} conexiones existentes.","No se puede conectar en este momento. Estado desconocido.","Escriba su nombre de usuario y contraseña para conectarse a Jupyter Hub","Escriba su nombre de usuario","Escriba la contraseña","Python is not installed. \nPlease [download](https://www.python.org/downloads) and install Python in order to execute cells in this notebook.","Python is not installed. \nPlease download and install Python in order to execute cells in this notebook from here https://www.python.org/downloads.","No se encontró el Kernel de Jupyter \"{0}\" y debe instalarse para ejecutar celdas en este cuaderno.","No se pudo iniciar Jupyter Notebook. \r\n{0}","El servidor remoto de Jupyter Server aportado por la extensión '{0}' ya no está disponible.","No se pudo conectar con el servidor remoto de Jupyter Server '{0}'. Compruebe que el servidor se está ejecutando y es accesible. ({1}).","No se pudo conectar con el servidor remoto de Jupyter Server '{0}'. Compruebe que el servidor se está ejecutando y es accesible.","Error de conexión. Compruebe que el servidor se está ejecutando y es accesible. ({0}).","Error de conexión. Compruebe que el servidor se está ejecutando y que se puede acceder a él desde un explorador. ({0}). Consulte https://aka.ms/vscjremoteweb para obtener más información.","Olvidar conexión","No se pudo conectar con el servidor de Jupyter remoto.\r\nCompruebe que se puede obtener acceso al URI del servidor de Jupyter desde un explorador.\r\n{0}. Haga clic [aquí](https://aka.ms/vscjremoteweb) para obtener más información.","Administrar conexiones","Cambie la conexión del servidor de Jupyter.","No se pudo conectar con el cuaderno de Jupyter remoto.\r\nEl servidor especificado está usando certificados autofirmados. Habilitar la opción Permitir conexión remota no autorizada para conectarse de todos modos\r\n{0}\r\n{1}","Conexión kernel directa","Conexión kernel directa interrumpida","El servidor de Jupyter se bloqueó. No se puede conectar. \r\nCódigo de error de Jupyter: {0}","Versión Notebook de Jupyter: {0}","No se puede crear una especificación de kernel de Jupyter y no hay ninguna disponible para su uso","El módulo \"Kernelspec\" no está instalado en el intérprete seleccionado ({0}).\r\n Vuelva a instalar o actualizar \"jupyter\".","Interrumpir Kernel de Jupyter","Borrar todas las salidas","Interrupción del Kernel de Jupyter","Cancelar","Script de Python","HTML","PDF","Se agotó el tiempo de espera de la interrupción del kernel. ¿Desea reiniciar el kernel en su lugar? Se perderán todas las variables.","La interrupción del teclado bloqueó el kernel. Kernel reiniciado.","URI del servidor de Jupyter: ","Error al ejecutar el código: {0}","Escriba código aquí y presione Mayús-Entrar para ejecutar","No se puede conectar con la sesión de Jupyter host. URI no encontrado.","No se admite la generación de cuadernos de Jupyter Notebook a través de una conexión de Live Share","Actualmente, no se admite la importación de cuadernos a través de una conexión de Live Share.","{0} Servidor de Jupyter","Error de sincronización durante el inicio de Live Share.","Error al iniciar el servicio '{0}' durante la conexión de Live Share.","No se pueden ejecutar celdas, se encontraron documentos duplicados para {0}.","No se pudo capturar la información de variable del servidor de Jupyter.","'{0}' no es una variable activa.","No se pudo crear una ventana interactiva. Intente reinstalar la extensión de Python.","Error durante la extracción de variables: \r\n{0}","cargando...","Capturando datos...","No hay filas que coincidan con el filtro actual","Servidor de Jupyter","Sin kernel","Sin iniciar","Cambiar Kernel","Seleccionar un Kernel diferente","Elija los kernels disponibles en el selector de kernel.","Cambiar intérprete","Local","El paquete de Python \"pandas\" es la versión {0}. Se requiere la versión 0.20 o posterior para ver los datos.","El paquete de Python \"pandas\" es necesario para ver los datos.","valores","Uno o varios invitados de la sesión no tienen instalada la extensión de Jupyter. La sesión de Live Share no puede continuar.","Las variables con más de 1000 columnas pueden tardar mucho tiempo en mostrarse. ¿Está seguro de que desea continuar?","Sí","No","No volver a preguntar","Permite filtrar varias filas. Use signos =, > o < para filtrar los valores numéricos.","--- Iniciar vista previa de {0} ---","--- Finalizar vista previa de {0} ---","Generando vista previa de {0}","Parcelas","Guardar imagen de trazado","Anterior","Siguiente","Pan","Acercar","Alejar","Exportar a diferentes formatos","Quitar","Introduce nuevas celdas aquí.","Imagen seleccionada","Imagen","Error al exportar la imagen: {0}","No se puede ver la variable porque se superó la velocidad de datos. Reinicie el servidor con un límite de velocidad de datos superior. Por ejemplo, --NotebookApp.iopub_data_rate_limit=10000000000.0","Agregar celda","Depurar celda","Paso a paso por procedimientos","Continuar","Detener","Ejecute la celda actual y agregue una celda vacía a continuación","El módulo pip {0} es necesario para depurar celdas. Tendrá que instalarlo para depurar celdas.","No se puede analizar la salida {0}. Registre un problema con https://github.com/microsoft/vscode-jupyter","No se puede abrir el puerto {0} para depuración. Especifique otro puerto en la configuración de remoteDebuggerPort.","No se puede conectar el puerto {0} para la depuración. Permita el puerto {0} a través del firewall.","Puertos del intervalo {0}: no se encuentra{1} para la depuración. Especifique un puerto en la configuración remoteDebuggerPort.","No se puede conectar un puerto para la depuración. Permita los puertos {0} {1} a través del firewall.","El módulo pip {0} es necesario para depurar celdas. ¿Desea instalar {0} y continuar con la depuración de la celda?","El módulo pip {0} es necesario para ejecutarse por línea. ¿Desea instalar {0} y continuar ejecutando por línea?","La versión de {0} instalada no admite la depuración de celdas. ¿Desea actualizar {0} a la versión más reciente y continuar con la depuración de la celda?","La versión de {0} instalada no admite la ejecución por línea. ¿Desea actualizar {0} a la versión más reciente y continuar ejecutando por línea?","Sí","No","Se canceló la celda debido a un error en una celda anterior.","Ir a [{0}]","# Para agregar una nueva celda, escriba '{0}'\r\n# Para agregar una nueva celda de Markdown, escriba '{0} [markdown]'\r\n","Editor de Notebook","Sin título","¿Quiere guardar los cambios efectuados en {0}?","Los cambios se perderán si no los guarda.","Guardar","No guardar","Cancelar","Guardar","Jupyter Notebooks","Exportar como","Guardar como archivo de Python","Exportar","Exportar como...","¿Desea abrir el archivo exportado?","Sí","No","Consulte el panel de [output] (command:jupyter.viewOutput) de \"Jupyter\" para obtener más detalles.","Si no ha instalado xelatex (TeX), tendrá que hacerlo para poder exportar a PDF. Para obtener más instrucciones, consulte https://nbconvert.readthedocs.io/en/latest/install.html#installing-tex. \r\nPara evitar la instalación de xelatex (TeX), puede intentar exportar a HTML y usar la característica \"Imprimir en PDF\" de los exploradores.","Error de exportación.","Ejecutar celda","Eliminar celda","Mover celda hacia arriba","Mover celda hacia abajo","Subir celda seleccionada","Eliminar celda","Insertar celda abajo","Insertar celda arriba","Agregar celda","Insertar celda","Convirtiendo ipynb en archivo de Python","No se ha seleccionado ninguna python","No se está ejecutando python -m jupyter notebook --version","Guardar imagen","No se pudo encontrar el kernel '{0}' con el que se creó el cuaderno. Uso del intérprete actual.","No se pudo encontrar el kernel '{0}' con el que se creó el cuaderno. Registro de un nuevo kernel mediante el intérprete actual.","No se pudo encontrar el kernel '{0}' con el que se creó el cuaderno.","Iniciando Jupyter desde {0}","Se agotó el tiempo de espera para iniciar Jupyter. Consulte el panel de salida de \"Jupyter\" para obtener más detalles.","Cambiando Kernel a '{0}'","Esperando a que la sesión de Jupyter esté inactiva","Capturando Kernels","Capturando Kernels","Capturando especificaciones de Kernel","Iniciando Jupyter Notebook","Registrando Kernel","La salida se ha recortado por motivos de rendimiento.\r\nPara ver la salida completa, establezca el valor \"jupyter.textOutputLimit\" en 0.","Predeterminado","La extensión de Python determinará la línea de comandos adecuada para Jupyter.","Personalizado","Personalizar la línea de comandos pasada a Jupyter al iniciar","Vuelva a cargar la ventana al cambiar la línea de comandos de Jupyter.","Recargar","Elija una opción","Seleccionar línea de comandos para Jupyter","Escriba la línea de comandos personalizada para Jupyter","Conectando con el servidor de Jupyter en {0}","{0}: Creando nuevo bloc de notas ","{0}: Kernel iniciado: {1}","El Kernel {0} no se puede usar. Compruebe la pestaña de salida de Jupyter para obtener más información.","{0}. No podemos iniciar un servidor de Jupyter porque el sistema operativo no es compatible. Seleccione un servidor que ya esté en ejecución si desea continuar.","Seleccionar servidor en ejecución","Existente","Seleccionar un servidor de Jupyter que ya esté en ejecución","Especificar el URI de un servidor existente","Quitar","Especificar el servidor de Jupyter para conexiones","Servidor de Jupyter: local","Servidor de Jupyter: remoto","Error al cargar {0}:{1}. Se requiere conexión a Internet para cargar widgets de terceros.","Los widgets requieren que descarguemos archivos auxiliares desde un sitio web de terceros. Haga clic [aquí](https://aka.ms/PVSCIPyWidgets) para obtener más información.","Los widgets requieren que descarguemos archivos auxiliares desde un sitio web de terceros.","Los widgets requieren que se descarguen archivos auxiliares de un sitio web de terceros. Haga clic <a href='https://command:jupyter.enableLoadingWidgetScriptsFromThirdPartySource'>aquí</a> para habilitarlo o haga clic <a href='https://aka.ms/PVSCIPyWidgets'>aquí</a> para obtener más información. (Error al cargar {0}:{1}).","Los widgets requieren que descarguemos archivos auxiliares desde un sitio web de terceros. (Error al cargar {0}:{1}).","Habilitar descargas","Mensaje de kernel no controlado de un widget: {0} : {1}","No se puede descargar el widget \"{0}\" desde el sitio web de terceros {1}, debido al acceso a la red. El comportamiento esperado puede verse afectado. Haga clic [aquí](https://aka.ms/PVSCIPyWidgets) para obtener más información.","No se encuentra el widget '{0}' versión '{1}' de los orígenes de widget configurados {2}. El comportamiento esperado puede verse afectado. Haga clic [aquí](https://aka.ms/PVSCIPyWidgets) para obtener más información.","No se puede cargar una versión compatible del widget 'qgrid'. Considere la posibilidad de cambiar a la versión 1.1.1.","Se inició el kernel {0}.","Ejecutar por línea (F10)","Ejecutar la línea siguiente (F10)","Detener","No se puede iniciar la sesión para el kernel {0}. Seleccione otro kernel con el que iniciar.","Conectando con kernel.","La conexión a través de HTTP sin un token puede ser una conexión no segura. ¿Desea conectarse a un servidor posiblemente no seguro?","Se denegó la conexión al servidor no seguro.","Conectado","Desconectada","No hay ningún kernel disponible para la ejecución de celdas. [Especifique un servidor de Jupyter para las conexiones](command:jupyter.selectjupyteruri)","IPy noKernel instalado en el intérprete {0}","Configuración de Ipykernel necesaria para esta característica","Configuración","Iniciando ejecución por línea","No se pudo crear el visor de datos. Compruebe la pestaña Jupyter de la ventana de salida para obtener más información.","Seleccione una opción para crear un cuaderno en blanco","Predeterminado","Se recomienda la extensión {0} para los cuadernos que tienen como destino el idioma \"{1}\"","No se inició el Kernel. Se necesita una sesión de kernel para iniciar la depuración.","No hay ningún documento de cuaderno activo para depurar.","No se puede iniciar la depuración.","Importando archivo de bloc de notas","Exportando a {0}","(Remoto) Sesión de Jupyter","Kernel de Jupyter","(Remoto) Kernel de Jupyter","Conda Env","Entorno Poetry","Entorno Pipenv","Entorno de PyEnv","Entorno Global","Entorno Virtual","The file '{0}' seems to be overriding built in modules and interfering with the startup of the kernel. Consider renaming the file and starting the kernel again.","\"!{0} install\" podría instalar paquetes en un entorno incorrecto. [Más información]({1})","Usar \"%{0} install\" en lugar de \"!{0} install\"","Reemplazar por \"%{0} install\"","No se pudo iniciar el kernel porque falta el módulo '{0}'. Considere la posibilidad de instalar este módulo.","No se pudo iniciar el kernel porque no se pudo importar el módulo '{0}'.","No se pudo iniciar el kernel porque no se pudo importar '{0}' desde '{1}'.","No se pudo iniciar el kernel porque no se pudo cargar un archivo DLL.","No se pudo iniciar el kernel porque no se pudo cargar el archivo DLL \"{0}\".","No se pudo iniciar el kernel debido a un error con el módulo Win32api. Considere (volver a) instalar este módulo.","No se pudo iniciar el kernel debido a un error con el módulo \"pyzmq\". Considere la posibilidad de volver a instalar este módulo.","No se pudo iniciar el kernel debido a una versión obsoleta de IPython. Considere la posibilidad de actualizar este módulo a la versión más reciente.","No se pudo iniciar el kernel debido a una versión obsoleta de IPyKernel. Considere la posibilidad de actualizar este módulo a la versión más reciente.","Widget '%matplotlib' funciona mejor dentro de VS Code","Más información","¿Desea conceder a la extensión '{0}' acceso a los Kernels de Jupyter? Al hacer clic en '{1}', esta extensión podrá ejecutar código en los Kernels de Jupyter.","Gracias por probar la API de Jupyter. Presente un problema en nuestro repositorio para usar esta API en producción. Esto nos impediría interrumpir la extensión al actualizar la API (ya que todavía está en curso).","Activando el entorno de Python '{0}'","{0} Celda {1}","Sí","No","No volver a preguntar","Se recomienda usar la versión preliminar de la extensión de Jupyter cuando se ejecuta en VS Code con usuarios de Insider. ¿Desea cambiar?","Consola del servidor de Jupyter","Salida de la consola de {0} Kernel","La operación no se admite en la versión web de la extensión de Jupyter.","Debe ser http(s)","No se pudo instalar la extensión de Python.","No hay ningún instalador de Conda o Pip disponible en el entorno seleccionado.","No hay ningún instalador Pip disponible en el entorno seleccionado.","Buscar ayuda","No se pudo instalar {0}. Si pip no está disponible, use el administrador de paquetes que prefiera para instalar manualmente esta biblioteca en el entorno de Python.","La biblioteca de ciencia de datos {0} no está instalada. ¿Desea instalarla?","Instalando {0}"]}