{"src/client/application/diagnostics/checks/macPythonInterpreter":["L'installazione di sistema macOS selezionata di Python non è consigliata. Alcune funzionalità nell'estensione saranno limitate. [Installare un'altra versione di Python](https://www.python.org/downloads) o selezionare un interprete diverso per un'esperienza ottimale. [Altre informazioni](https://aka.ms/AA7jfor)."],"src/client/application/diagnostics/checks/powerShellActivation":["L'attivazione dell'ambiente Python selezionato non è supportata in PowerShell. Prova a modificare la shell in Prompt dei comandi."],"src/client/application/diagnostics/checks/pythonInterpreter":["Non è stato selezionato alcun interprete Python. Seleziona un interprete Python per abilitare funzionalità come IntelliSense, la linting e il debug.","È stato selezionato un interprete Python non valido{0}. Prova a modificarlo per abilitare funzionalità quali IntelliSense, linting e debug."],"src/client/browser/localize":["Stato di Python IntelliSense","Modalità parziale","IntelliSense limitato fornito da Pylance","Altre informazioni"],"src/client/common/experiments/service":["L'esperimento '{0}' è inattivo","L'esperimento '{0}' è attivo","L'esperimento '{0}' è inattivo","L'esperimento '{0}' è attivo","L'esperimento '{0}' è attivo"],"src/client/common/installer/moduleInstaller":["Installazione di {0}"],"src/client/common/installer/productInstaller":["Usare {0}","Il formattatore {0} non è stato installato. Installare?","Il percorso del formattatore {0} non è valido ({1})","Linter {0} non è installato.","Il percorso dell'linter {0} non è valido ({1})","Il {0} del framework di test non è installato. Installare?","Il percorso del framework di test {0} non è valido ({1})","Non è stato possibile installare {0}. Se pip non è disponibile, si consiglia di usare la gestione pacchetti desiderata per installare manualmente la libreria nell'ambiente Python.","La libreria data science {0} non è stata installata. Installarla?"],"src/client/common/net/fileDownloader":["Download di {0}...","{0}{1} di {2} KB ({3}%)"],"src/client/common/utils/localize":["Il supporto della mapping di origine è abilitato nell'estensione Python. Ciò influirà negativamente sulle prestazioni dell'estensione.","Disabilitare il supporto mapping di origine","L'abilitazione del supporto mapping di origine nell'estensione Python influirà negativamente sulle prestazioni dell'estensione.","Abilitare e ricaricare la finestra.","Il sistema operativo non soddisfa i requisiti minimi del server di linguaggio Python. È in corso il ripristino del provider di completamento automatico alternativo, Jedi.","L'impostazione \"python.pythonPath\" nel file settings.json non è più usata dall'estensione Python. Se si desidera, è possibile usare una nuova impostazione denominata \"python.defaultInterpreterPath\". Si tenga presente che è necessario modificare manualmente il valore di questa impostazione poiché l'estensione Python non viene modificata quando si modificano gli interpreti. [Altre informazioni](https://aka.ms/AA7jfor).","È necessario selezionare un interprete Python prima di avviare il debug.\r\n\r\nSuggerimento: fare clic su \"Seleziona interprete Python\" nella barra di stato.","Il percorso Python nella configurazione di debug non è valido.","Per usare il tipo di debugger \"python\", è necessario aggiornare il file launch.json per modificare le configurazioni di debug \"pythonExperimental\", altrimenti il debug Python potrebbe non funzionare. Aggiornare automaticamente il file launch.json ora?","È necessario aggiornare il file launch.json per modificare la stringa del tipo di console da \"None\" a \"internalConsole\", altrimenti il debug Python potrebbe non funzionare. Aggiornare automaticamente il file launch.json ora?","La configurazione \"debugStdLib\" in launch.json non è più supportata. È consigliabile sostituirla con \"justMyCode\", che è l'esatto contrario dell'uso di \"debugStdLib\". Aggiornare automaticamente il file launch.json per eseguire questa operazione?","Sì, aggiornare launch.json","È necessario aggiornare le impostazioni per modificare \"python.unitTest.\" in \"python.testing.\". In caso contrario il test del codice Python con l'estensione potrebbe non funzionare. Aggiornare automaticamente le impostazioni ora?","Sì, aggiornare le impostazioni","È stata trovata una configurazione obsoleta per l'ordinamento delle importazioni nell'area di lavoro. Consultare la [guida all'aggiornamento di isort](https://aka.ms/AA9j5x4) per aggiornare le impostazioni.","L'estensione Python ora include l'estensione Pylance per migliorare i completamenti, l'esplorazione del codice, le prestazioni generali e molto altro ancora. È possibile ottenere altre informazioni sull'aggiornamento e su come modificare i server di linguaggio [qui](https://aka.ms/new-python-bundle).\r\n\r\nConsultare la licenza di Pylance [qui](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license).","Sì","No","Sì, per favore","Annullato","Annulla","OK","Errore","OK","Installa","Caricamento dell'estensione Python in corso...","Mostrare output","No, lo farò in seguito","Non ora","Non visualizzare più","Ricarica","Altre informazioni","Altre informazioni","e","Segnalare questo problema","Scelta consigliata","Cancella tutto","Ignora sempre","Ignorare","È possibile selezionare l'interprete Python","Apri launch.json","Usa prompt dei comandi","Download","Ricordamelo più tardi","Sì, rispondo ora al sondaggio","No, grazie","Collega a processo","Selezionare il processo a cui collegarsi","Non è stato selezionato alcun processo","Aggiornare l'elenco dei processi","Ricordamelo più tardi","L'estensione Pylance non è installata.","L'estensione Pylance è ora installata. Ricaricare la finestra per l'attivazione?","L'estensione Pylance non è stata installata, tuttavia il valore python.languageServer è impostato su \"Pylance\". Installare l'estensione per usare Pylance o ripristinare Jedi?","Installa Pylance","Ripristina Jedi","Immettere l'URL del repository remoto","Immettere un URL che punti a una directory remota contenente i file di log di TensorBoard","TensorBoard cercherà i file tfevent in tutte le sottodirectory della directory di lavoro corrente","Usare la directory di lavoro corrente","Selezionare una directory di log con cui avviare TensorBoard","Avvio della sessione TensorBoard in corso...","VS Code ha ora il supporto TensorBoard integrato. Avviare TensorBoard?  (Suggerimento: avviare TensorBoard in qualsiasi momento aprendo il riquadro comandi e cercando \"Avvia TensorBoard\".)","Selezionare una cartella","Selezionare una directory di log contenente i file tfevent","Selezionare un'altra cartella","Usare Esplora file per selezionare un'altra cartella","Il pacchetto TensorBoard è necessario per avviare una sessione TensorBoard. Installarlo?","TensorBoard >= 2.4.1 e il plug-in TensorBoard Profiler PyTorch >= 0.2.0 sono obbligatori. Installare questi pacchetti?","È consigliabile installare la versione >= 0.2.0 del plug-in TensorBoard di PyTorch Profiler. Installare il pacchetto?","Il supporto di TensorBoard integrato è disponibile solo per TensorBoard >= 2.4.1. Aggiornare la copia di TensorBoard?","▶ Avvia sessione TensorBoard","Avvia sessione TensorBoard","Non è stato possibile individuare sul disco il file di origine richiesto. Specificare manualmente il file.","Scegli file","I contenuti del file di origine potrebbe non corrispondere ai contenuti originali nella traccia.","IntelliSense limitato supportato da Jedi e Pylance","Stato di Python IntelliSense","Modalità parziale","IntelliSense limitato fornito da Pylance","Avvio del server di linguaggio Pylance.","Il supporto dell'editor non è attivo poiché il server di linguaggio è impostato su None.","Nelle aree di lavoro non attendibili è supportata solo l'estensione Pylance. Il server di linguaggio verrà impostato su Nessuno.","Si consiglia di ricaricare la finestra passando da un server di linguaggio all'altro.","Si è verificato un problema durante l'avvio del server di linguaggio. È in corso il ripristino del motore di linguaggio Jedi. Per informazioni dettagliate, vedere il pannello di output di Python.","Si è verificato un problema durante il download del server di linguaggio. È in corso il ripristino del motore di linguaggio Jedi. Per informazioni dettagliate, vedere il pannello di output di Python.","Si è verificato un problema durante l'estrazione del server di linguaggio. È in corso il ripristino del motore di linguaggio Jedi. Per informazioni dettagliate, vedere il pannello di output di Python.","Il download del server di linguaggio non è riuscito.","L'estrazione del server di linguaggio non è riuscita.","Il download del server di linguaggio è stato completato.","fine.","I percorsi di ricerca per questo interprete Python sono stati modificati. Si consiglia di ricaricare l'estensione per assicurarsi che IntelliSense funzioni correttamente.","Installazione di Python nell'ambiente in corso...","Individuazione degli interpreti Python","Aggiornamento degli interpreti Python","Abbiamo rilevato l'uso di un ambiente Conda. Se si verificano problemi nel terminale integrato, è consigliabile permettere all'estensione Python di modificare \"terminal.integrated.inheritEnv\" in False nelle impostazioni utente.","Abbiamo rilevato che è stato creato un nuovo ambiente virtuale. Selezionarlo per la cartella dell'area di lavoro?","Selezionare a livello di area di lavoro","Cancellare a livello di area di lavoro","Suggerimento: è possibile modificare l'interprete Python usato dall'estensione facendo clic sulla barra di stato nella versione di Python","Globale","Area di lavoro","Immettere il percorso dell'interprete...","Immettere il percorso a un interprete Python.","È possibile usare Python dall'impostazione 'python.defaultInterpreterPath'","Trova...","Esplorare il file system per individuare un interprete Python.","Selezionare interprete","È possibile selezionare l'interprete Python","Aggiorna elenco interpreti","Server di linguaggio Python","Python","Log test di Python","cwd:","Selezionare Linter","Non è disponibile alcun programma di installazione Conda o Pip nell'ambiente selezionato.","Nell'ambiente selezionato, non è disponibile alcun programma di installazione Pip.","Cercare supporto","È possibile inviare un feedback su come funziona l'estensione Python?","Sì, rispondo ora al sondaggio","No, grazie","Magari più tardi","Selezionare una configurazione di debug","Configurazione di debug","Python","Consente di selezionare una configurazione di debug Python","Python: file corrente","File Python","Eseguire il debug del file Python attivo al momento","Python: modulo","enter-your-module-name","Modulo","Eseguire il debug di un modulo Python richiamandolo con '-m'","Modulo di debug","Immettere un nome del modulo/pacchetto Python","enter-your-module-name","Immettere un nome del modulo valido","Python: collegamento remoto","Collegamento remoto","Consente il collegamento a un server di debug remoto","Debug remoto","Immettere un nome host o un indirizzo IP valido","Immettere un nome host o un indirizzo IP valido","Debug remoto","Immettere il numero di porta di cui il server di debug è in ascolto","Immettere un numero di porta valido","Python: collegare tramite ID processo","Collegare tramite ID processo","Consente il collegamento a un processo locale","Python: Django","Django","Avviare ed eseguire il debug di un'applicazione Web Django","Eseguire il debug di Django","Immettere il percorso di manage.py ('${workspaceFolderToken}' punta alla radice della cartella dell'area di lavoro corrente)","Immettere un percorso di file Python valido","Python: FastAPI","FastAPI","Avviare ed eseguire il debug di un'applicazione Web FastAPI","Eseguire il debug di FastAPI","Immettere il percorso dell'applicazione, ad esempio 'main.py' o 'main'","Immettere un nome valido.","Python: Flask","Flask","Avviare ed eseguire il debug di un'applicazione Web Flask","Eseguire il debug di Flask","Python: Flask","Immettere un nome valido.","Python: applicazione Pyramid","Pyramid","Avviare ed eseguire il debug di un'applicazione Web Pyramid","Eseguire il debug di Pyramid","Immettere un percorso di file valido","È possibile configurare il framework di test","On è configurato alcun framework di test.","L'individuazione dei test UnitTest è stata annullata","Errore di individuazione dei test UnitTest","(vedere Output > Python)","Abbiamo rilevato che si sta tentando il collegamento a ptvsd (debugger Python) che è stato deprecato il 1° maggio 2020. È consigliabile passare a [debugpy](https://aka.ms/migrateToDebugpy).","IntelliSense con Jedi per Python 2.7 non è più supportato. [Altre informazioni](https://aka.ms/python-27-support).","Il server di linguaggio Microsoft Python ha raggiunto la fine del ciclo di vita. È stato impostato sul valore predefinito per Python in VS Code, Pylance.\r\n\r\nSe si vuole modificare il server di linguaggio, è possibile ottenere informazioni su come eseguire questa operazione [qui](https://devblogs.microsoft.com/python/python-in-visual-studio-code-may-2021-release/#configuring-your-language-server).\r\n\r\nConsultare la licenza di Pylance [qui](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license)."],"src/client/debugger/extension/banner":["Puoi spendere 2 minuti per indicarci come sta funzionando il debugger secondo te?"],"src/client/debugger/extension/adapter/factory":["Installare Python o selezionare un interprete Python per usare il debugger."],"src/client/debugger/extension/attachQuickPick/provider":["Il sistema operativo '{0}' non è supportato."],"src/client/debugger/extension/configuration/providers/pyramidLaunch":["`Immettere il percorso di development.ini ({0} punta alla radice della cartella dell'area di lavoro corrente)"],"src/client/debugger/extension/hooks/childProcessAttachService":["Non è stato possibile avviare il debugger per il processo figlio {0}"],"src/client/formatters/blackFormatter":["Il nero non supporta il comando \" Selezione formato\""],"src/client/interpreter/configuration/pythonPathUpdaterService":["Impossibile impostare il percorso dell'interprete. Errore: {0}"],"src/client/interpreter/configuration/interpreterSelector/commands/setInterpreter":["Interprete selezionato: {0}"],"src/client/interpreter/display/index":["Percorso interprete Python: {0}","Percorso interprete Python: {0}"],"src/client/languageServer/watcher":["Avvio del server di linguaggio Jedi per {0}."],"src/client/linters/linterCommands":["Nelle impostazioni sono abilitati più linter. Sostituire con '{0}'?"],"src/client/linters/errorHandlers/standard":["Errore durante l'esecuzione dell'linter '{0}'"],"src/client/providers/importSortProvider":["Apri un file Python per ordinare le importazioni."],"src/client/tensorBoard/tensorBoardSession":["Corrente: {0}"],"src/client/tensorBoard/tensorBoardSessionProvider":["Non è stato possibile avviare una sessione TensorBoard a causa dell'errore seguente: {0}"],"src/client/terminals/codeExecution/helper":["Nessun file aperto da eseguire nel terminale","Il file attivo deve essere salvato prima di poter essere eseguito","Il file attivo non è un file di origine Python)"],"src/client/testing/common/debugLauncher":["Non è stato possibile caricare unit test configurazione da launch.json perché manca un campo"]}